Revit 2027 API
Schema.GetField Method
 Gets a Field of a given name from the Schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Field GetField(
	string name
)
Public Function GetField (
	name As String
) As Field
public:
Field^ GetField(
	String^ name
)
member GetField :
        name : string -> Field
Parameters
name String
 The Field name
Return Value
Field
 The Field
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Reading of Entities of this Schema is not allowed to the current add-in.
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace